Repository: flyeblue/opencv401
Catalog: omegat/project_save.tmx
Source language: en_us
Languages: zh

source: Let's try to restore them with a technique called image inpainting.
zh: 让我们用一种被称为图像修复的技术恢复它们.

source: Let's use SVM functionalities in OpenCV
zh: 我们在OpenCV中使用SVM功能

source: Loading exposure images into a list
zh: 将曝光图像加载到列表中

source: Logo
zh: 徽标

source: Long Way : use OpenCV drawing functions
zh: 长路：使用OpenCV绘图功能

source: MEDIA DEVICES
zh: 媒体设备

source: Machine Learning
zh: 机器学习

source: Making Borders for Images (Padding)
zh: 制作图像边框（填充）

source: Mask and Pixel Points
zh: 蒙版和像素点

source: Matplotlib comes with a histogram plotting function : matplotlib.pyplot.hist()
zh: Matplotlib附带直方图绘图功能：: matplotlib.pyplot.hist()

source: Maximum Value, Minimum Value and their locations
zh: 最大值，最小值及其位置

source: Mean Color or Mean Intensity
zh: 平均颜色或平均强度

source: Meanshift and Camshift
zh: Meanshift 和 Camshift

source: Median Blurring
zh: 中位数模糊

source: Member Function Documentation
zh: 成员函数文档

source: Merge exposures into HDR image
zh: 将曝光合并到HDR图像中

source: Merge exposures using Mertens fusion
zh: 使用Mertens融合合并曝光

source: More features can be found at Matlab regionprops documentation.
zh: 更多 功能 可以查看Matlab regionprops 文档.

source: Most useful ones are nFeatures which denotes maximum number of features to be retained (by default 500), scoreType which denotes whether Harris score or FAST score to rank the features (by default, Harris score) etc.
zh: 最有用的是nFeatures，表示要保留的最大要素数（默认为500），scoreType表示Harris得分或FAST得分是否对要素进行排名（默认情况下为Harris得分）等。

source: My criteria is such that, whenever 10 iterations of algorithm is ran, or an accuracy of epsilon = 1.0 is reached, stop the algorithm and return the answer.
zh: 我的标准是这样的，每当运行10次算法迭代，或者达到epsilon = 1.0的精度时，停止算法并返回答案.

source: Need to be given in square brackets.
zh: 需要在方括号中给出。

source: Next we need to find the area which we are sure they are not coins.
zh: 接下来我们需要找到我们确定它们不是硬币的区域.

source: No, we need just two end points of that line.
zh: 不，我们只需要该线的两个端点.

source: Normally two flags are used for this : cv.KMEANS_PP_CENTERS and cv.KMEANS_RANDOM_CENTERS.
zh: 通常会使用两个标志：cv.KMEANS_PP_CENTERS 和 cv.KMEANS_RANDOM_CENTERS.

source: Normally, it is [0,256], ie all intensity values.
zh: 通常，它是[0,256]，即所有强度值。

source: Normally, it is [0,256].
zh: 通常，它是[0,256]。

source: Note
zh: 备注

source: Note that, row = x and column = y.
zh: 注意, row = x and column = y.

source: Note, that latter does not imply that tracker has failed, maybe target is indeed missing from the frame (say, out of sight)
zh: 注意, 后者 绝对不是 暗示跟踪器失败, 可能目标确实从帧总丢失 (例如, 视线之外)

source: Notice that the HDR image is of type float32, and not uint8, as it contains the full dynamic range of all exposure images.
zh: 请注意，HDR图像的类型为float32，而不是uint8，因为它包含所有曝光图像的完整动态范围.

source: Now I am directly moving to the code:
zh: 现在我直接转到代码：

source: Now for descriptors, ORB use BRIEF descriptors.
zh: 现在对于描述符，ORB使用简要描述符。

source: Now let's discuss an important concept, "Optical Flow", which is related to videos and has many applications.
zh: 现在让我们讨论一个重要的概念，“光流”，它与视频有关并有许多应用.

source: Now our marker is ready.
zh: 现在我们的标记准备好了。

source: Now we apply the KMeans function.
zh: 现在我们可以应用 KMeans 函数。

source: Now we have an idea on what is histogram, we can look into how to find this.
zh: 现在我们知道什么是直方图，我们可以研究如何找到它。

source: Now we know for sure which are region of coins, which are background and all.
zh: 现在我们确定哪个是硬币区域，哪个是背景和所有.

source: Now we need to remove any small white noises in the image.
zh: 现在我们需要去除图像中的任何小白噪声.

source: Now we plot A in Red color and B in Blue color and their centroids in Yellow color.
zh: 现在我们用红色绘制A，用蓝色绘制B，用黄色绘制质心。

source: Now we set a condition that atleast 10 matches (defined by MIN_MATCH_COUNT) are to be there to find the object.
zh: 现在我们设置一个条件，即至少10个匹配（由MIN_MATCH_COUNT定义）将在那里找到对象。

source: Now we should plot histograms, but how?
zh: 现在我们应该绘制直方图，但是如何？

source: Now we split the data to different clusters depending on their labels.
zh: 现在我们根据标签将数据拆分到不同的集群。

source: Now we will see how to apply K-Means algorithm with three examples.
zh: 现在我们将看到如何应用K-Means算法和三个例子。

source: Numpy Examples List
zh: Numpy示例

source: Numpy also provides you a function, np.histogram().
zh: Numpy 当然提供了相应的函数 np.histogram().

source: Numpy gives coordinates in **(row, column)** format, while OpenCV gives coordinates in **(x,y)** format.
zh: Numpy以**(row, column)**格式给出坐标，而OpenCV给出**(x,y)** 格式的坐标.

source: Numpy has another function, np.bincount() which is much faster than (around 10X) np.histogram().
zh: Numpy还有另外一个函数，np.bincount() ，它比 np.histogram()快很多（大概10x）。

source: Numpy indexing is faster:
zh: Numpy索引更快:

source: Numpy is a optimized library for fast array calculations.
zh: Numpy是一个用于快速阵列计算的优化库.

source: ORB is a good choice in low-power devices for panorama stitching etc.
zh: ORB是用于全景拼接等的低功率设备的不错选择。

source: ORB is basically a fusion of FAST keypoint detector and BRIEF descriptor with many modifications to enhance the performance.
zh: ORB基本上是FAST关键点检测器和Brief描述符的融合，具有许多修改以增强性能。

source: Object Detection
zh: 目标检测

source: Object is marked in white color in cluttered image:
zh: 对象在杂乱图像中以白色标记：

source: Once we get this 3x3 transformation matrix, we use it to transform the corners of queryImage to corresponding points in trainImage.
zh: 一旦我们得到这个3x3变换矩阵，我们就用它将queryImage的角转换为trainImage中的对应点。

source: One reason to do so is to reduce the memory.
zh: 这样做的一个原因是减少内存。

source: Only region we are not sure is the boundary region of coins.
zh: 只有我们不确定的区域是硬币的边界区域.

source: Open Source Computer Vision
zh: 开放源代码计算版本

source: OpenCV Documentation
zh: OpenCV 文档

source: OpenCV Forum
zh: OpenCV 论坛

source: OpenCV addition is a saturated operation while Numpy addition is a modulo operation.
zh: OpenCV加法是一种饱和运算（一种所有操作都在限定范围中的算术方法），Numpy 加法是取模运算

source: OpenCV developers will check your pull request, give you important feedback and (once it passes the approval of the reviewer) it will be merged into OpenCV.
zh: OpenCV开发人员将检查您的请求，给您重要的反馈，并且（一旦通过审核人员的批准），它将合并到OpenCV中。

source: OpenCV function is faster than (around 40X) than np.histogram().
zh: OpenCV 函数比np.histogram()快得多(大约 40X) 。

source: OpenCV function will provide a better result.
zh: OpenCV函数将获得更好的结果

source: OpenCV has a function, cv.goodFeaturesToTrack().
zh: OpenCV 函数, cv.goodFeaturesToTrack().

source: OpenCV introduces a new set of tutorials which will guide you through various functions available in OpenCV-Python.
zh: OpenCV 教程 它将指导您完成OpenCV-Python中提供的各种功能

source: OpenCV now supports a multitude of algorithms related to Computer Vision and Machine Learning and is expanding day by day.
zh: OpenCV现在支持与计算机视觉和机器学习相关的众多算法，并且正在日益扩展。

source: OpenCV provides a function cv.filter2D() to convolve a kernel with an image.
zh: OpenCV 提供函数 cv.filter2D() 来用内核卷积图片.

source: OpenCV provides mainly four types of blurring techniques.
zh: OpenCV主要提供四种模糊技术.

source: OpenCV samples has an interactive sample on watershed segmentation, watershed.py.
zh: OpenCV样本有一个关于分水岭分割的交互式样本, watershed.py.

source: OpenCV supports a wide variety of programming languages such as C++, Python, Java, etc., and is available on different platforms including Windows, Linux, OS X, Android, and iOS.
zh: OpenCV支持各种编程语言，如C ++，Python，Java等，可在不同的平台上使用，包括Windows，Linux，OS X，Android和iOS。

source: OpenCV was started at Intel in 1999 by Gary Bradsky, and the first release came out in 2000.
zh: OpenCV于1999年在英特尔由Gary Bradsky创立，第一个正式版发布于 2000年。

source: OpenCV-Python Bindings
zh: OpenCV-Python 绑定

source: OpenCV-Python Tutorials
zh: OpenCV-Python 教程

source: OpenCV-Python is a Python wrapper for the original OpenCV C++ implementation.
zh: OpenCV-Python是原始OpenCV C ++实现的Python包装器。

source: OpenCV-Python is a library of Python bindings designed to solve computer vision problems.
zh: OpenCV-Python是一个Python绑定库，旨在解决计算机视觉问题。

source: OpenCV-Python is the Python API for OpenCV, combining the best qualities of the OpenCV C++ API and the Python language.
zh: OpenCV-Python是OpenCV的Python API，结合了OpenCV C ++ API和Python语言的最佳特性。

source: OpenCV-Python makes use of Numpy, which is a highly optimized library for numerical operations with a MATLAB-style syntax.
zh: OpenCV-Python使用Numpy，它是一个高度优化的数据库操作库，具有MATLAB风格的语法。.

source: OpenCV.js Tutorials
zh: OpenCV.js 教程

source: OpenCV: Basic Operations on Images
zh: OpenCV: 图像的基本操作

source: OpenCV: Class List
zh: OpenCV: 类列表t

source: OpenCV: Contour Properties
zh: OpenCV: 分布图 属性

source: OpenCV: Contours : Getting Started
zh: OpenCV: 轮廓：入门

source: OpenCV: Histograms - 2: Histogram Equalization
zh: OpenCV: 直方图 - 2: 直方图均衡化

source: OpenCV: Hough Line Transform
zh: OpenCV: 霍夫线变换

source: OpenCV: Image Segmentation with Watershed Algorithm
zh: OpenCV: 基于分水岭算法的图像分割

source: OpenCV: Install OpenCV-Python in Ubuntu
zh: OpenCV: 在 Ubuntu安装OpenCV-Python

source: OpenCV: Introduction to OpenCV-Python Tutorials
zh: OpenCV: OpenCV-Python 教程前言

source: OpenCV: Shi-Tomasi Corner Detector & Good Features to Track
zh: OpenCV: Shi-Tomasi角落探测器和追踪的良好特征

source: Operation is like this: keep this kernel above a pixel, add all the 25 pixels below this kernel, take its average and replace the central pixel with the new average value.
zh: 操作如下：将此内核保持在像素上方，将此内核下方的所有25个像素相加，取其平均值并将中心像素替换为新的平均值.

source: Optical Flow
zh: 光流

source: Or
zh: 或者

source: Or it can be average intensity of the object in grayscale mode.
zh: 或者它可以是灰度模式下对象的平均强度.

source: Or you can use normal plot of matplotlib, which would be good for BGR plot.
zh: 或者你可以使用matplotlib的正常图，这对BGR图有好处。

source: Orientation
zh: 取向

source: Orientation is the angle at which object is directed.
zh: 方向是对象定向的角度.

source: Otherwise go for Numpy indexing.
zh: 尽量使用Numpy索引.

source: Otherwise simply show a message saying not enough matches are present.
zh: 否则只显示一条消息，说明没有足够的匹配。

source: Output parameters
zh: Output 参数

source: Parameters
zh: 参数

source: Pass an argument normalize=False to the function.
zh: 将参数normalize = False传递给函数.

source: Pay attention for the data types, as the images should be 1-channel or 3-channels 8-bit (np.uint8) and the exposure times need to be float32 and in seconds.
zh: 注意数据类型，因为图像应该是1通道或3通道8位（np.uint8），曝光时间需要为float32并且以秒为单位。

source: Performs a marker-based image segmentation using the watershed algorithm.
zh: 使用分水岭算法执行基于标记的图像分割。

source: Performs the perspective matrix transformation of vectors.
zh: 执行向量的透视矩阵变换。

source: Plot histograms, using OpenCV and Matplotlib functions
zh: 绘制直方图，使用OpenCV和Matplotlib函数

source: Plotting Histograms
zh: 绘制直方图

source: Prior knowledge of Python and Numpy is recommended as they won't be covered in this guide.
zh: 建议事先了解Python和Numpy，因为本指南不涉及它们。

source: Protected Attributes
zh: 受保护的属性

source: Protected Member Functions inherited from cv::Algorithm
zh: 受保护的成员函数，继承自 cv::Algorithm

source: Public Member Functions
zh: 公共成员函数

source: Python is a general purpose programming language started by Guido van Rossum that became very popular very quickly, mainly because of its simplicity and code readability.
zh: Python 是一种由Guido van Rossum 开发的编程语言，它很快变得非常流行，主要是因为它简单和可读性好。.

source: ROI is again obtained using Numpy indexing.
zh: 使用Numpy索引再次获得ROI.

source: Reads algorithm parameters from a file storage.
zh: 从文件读取算法参数.

source: Recovering high dynamic range radiance maps from photographs.
zh: 从照片中恢复高动态范围辐射图.

source: Remaining area which are sure background are shown in lighter blue compared to unknown region.
zh: 与未知区域相比，确定背景的剩余区域以浅蓝色显示。

source: Remember, in previous case, we made our data to a single column vector.
zh: 请记住，在前一种情况下，我们将数据制作为单个列向量。

source: Remember, we together can make this project a great success !!!
zh: 记住，我们 一起能让这个项目获得巨大成功

source: Result:
zh: 结果:

source: Results are also same, but with a slight difference.
zh: 结果也相同，但略有不同.

source: Returns Gaussian filter coefficients.
zh: 返回高斯滤波器系数.

source: Right image shows the final result.
zh: 右图显示最终结果。

source: Run it, Enjoy it, then learn it.
zh: 运行它，享受它，然后学习它.

source: See a good technique to remove noises in images called Non-Local Means Denoising
zh: 请参阅一种很好的技术来消除图像中的噪声，称为非局部均值去噪

source: See also
zh: 也可以看看

source: See the code below:
zh: 看下面的代码：

source: See the image below.
zh: 看下面的图片.

source: See the result below for K=8:
zh: K=8的结果

source: See the result below.
zh: 请参阅下面的结果。

source: See the result below:
zh: 请参阅下面的结果:

source: See the result shown in JET colormap.
zh: 查看JET色彩映射中显示的结果.

source: See the result.
zh: 查看结果

source: See, how much memory it saves!!!
zh: 看，它节省了多少内存!!!

source: See, the texture on the surface is gone, but edges are still preserved.
zh: 看，表面上的纹理消失了，但边缘仍然保留.

source: See, there are three arguments in cv.findContours() function, first one is source image, second is contour retrieval mode, third is contour approximation method.
zh: 在 cv.findContours() 函数的参数, 第一个是源图片, 第二是轮廓检索模式, 第三是轮廓近似法.

source: Setting Region of Interest (ROI)
zh: 设置感兴趣区域（ROI）

source: Shi-Tomasi Corner Detector & Good Features to Track
zh: Shi-Tomasi角落探测器和追踪的良好特征

source: Short Way : use Matplotlib plotting functions
zh: 简短方法：使用Matplotlib绘图功能

source: Similarly remaining rows corresponds to heights and weights of other people.
zh: 类似地，剩余的行对应于其他人的高度和重量。

source: Simply load an image in grayscale mode and find its full histogram.
zh: 只需以灰度模式加载图像并找到其完整的直方图。

source: Since OpenCV 3.2, findContours() no longer modifies the source image.
zh: 从 OpenCV 3.2, findContours() 不在修改源图片.

source: Since OpenCV is an open source initiative, all are welcome to make contributions to the library, documentation, and tutorials.
zh: OpenCV是一个开源计划，欢迎所有人为图书馆，文档和教程做出贡献。

source: Smoothing Images
zh: 平滑图片

source: So OpenCV implemented a marker-based watershed algorithm where you specify which are all valley points are to be merged and which are not.
zh: 因此，OpenCV实施了一个基于标记的分水岭算法，您可以在其中指定要合并的所有谷点，哪些不合并。

source: So RED and BLUE channels will be interchanged):
zh: 因此RED和BLUE频道将互换):

source: So always better stick to OpenCV functions.
zh: 所以最好用OpenCV函数

source: So basically the answers will be interchanged.
zh: 所以答案基本上是互换的.

source: So before finding contours, apply threshold or canny edge detection.
zh: 因此，在找到轮廓之前，应用阈值或canny边缘检测.

source: So do it only if you need it.
zh: 所以仅仅在需要的时候.

source: So edges are blurred a little bit in this operation.
zh: 因此在此操作中边缘会有点模糊.

source: So final range would be 255-255.99.
zh: 所以最后的范围将是 255-255.99.

source: So for one-dimensional histograms, you can better try that.
zh: 因此，对于一维直方图，您可以更好地尝试。

source: So good matches which provide correct estimation are called inliers and remaining are called outliers.
zh: 因此，提供正确估计的良好匹配称为内点，剩余称为异常值。

source: So here it is 1.
zh: 所以这里是1。

source: So instead of calcHist() function, you can try below line :
zh: 而不是calcHist()函数，你可以尝试下面的行：

source: So it blurs the edges also, which we don't want to do.
zh: 所以它也模糊了边缘，我们不想这样做.

source: So it preserves the edges since pixels at edges will have large intensity variation.
zh: 因此它保留了边缘，因为边缘处的像素将具有较大的强度变化.

source: So let's do it !!!
zh: 那就让我们做吧！！！

source: So let's start with a sample image.
zh: 那么让我们从一个示例图像开始吧。

source: So now we use cv.calcHist() function to find the histogram.
zh: 所以我们用 cv.calcHist()函数计算直方图

source: So remember, object to be found should be white and background should be black.
zh: 所以请记住，要找到的对象应该是白色，背景应该是黑色.

source: So simply accessing each and every pixel values and modifying it will be very slow and it is discouraged.
zh: 因此，简单地访问每个像素值并对其进行修改将非常缓慢，并且不鼓励这样做.

source: So stick with OpenCV function.
zh: 所以坚持使用OpenCV功能。

source: So we create marker (it is an array of same size as that of original image, but with int32 datatype) and label the regions inside it.
zh: 所以我们创建标记（它是一个与原始图像大小相同的数组，但是使用int32数据类型）并标记其中的区域。

source: So we have 'z' which is an array of size 50, and values ranging from 0 to 255.
zh: 所以我们有'z'，它是一个大小为50的数组，值范围从0到255。

source: So we need to extract the area which we are sure they are coins.
zh: 所以我们需要提取我们确定它们是硬币的区域.

source: So we need to reshape the image to an array of Mx3 size (M is number of pixels in image).
zh: 因此，我们需要将图像重塑为Mx3大小的数组（M是图像中的像素数）。

source: So we start by creating data and plot it in Matplotlib
zh: 因此，我们首先创建数据并在Matplotlib中绘制它

source: So we want to mark it with different integer.
zh: 所以我们想用不同的整数来标记它.

source: So what ORB does is to "steer" BRIEF according to the orientation of keypoints.
zh: 因此，ORB所做的是根据关键点的方向“引导”Brief。

source: So what about rotation invariance?
zh: 那么旋转不变性呢？

source: So what is histogram ?
zh: 那直方图是什么？

source: So what we did in last session?
zh: 那我们上章节做了什么？

source: So what you do is simply split the whole histogram to 16 sub-parts and value of each sub-part is the sum of all pixel count in it.
zh: 所以你要做的只是将整个直方图分成16个子部分，每个子部分的值是其中所有像素数的总和。.

source: So whatever remaining, we can be sure it is coin.
zh: 所以无论如何，我们可以肯定它是硬币.

source: So you can do it with bitwise operations as below:
zh: 所以你可以像下面这样用位运算：

source: So you need to stretch this histogram to either ends (as given in below image, from wikipedia) and that is what Histogram Equalization does (in simple words).
zh: 所以你需要将这个直方图拉伸到两端（如下图所示，来自维基百科），这就是直方图均衡所做的（简单来说）.

source: So, now we know for sure that region near to center of objects are foreground and region much away from the object are background.
zh: 所以，现在我们确切地知道靠近物体中心的区域是前景，而远离物体的区域是背景。

source: Solidity
zh: 密实度

source: Solidity is the ratio of contour area to its convex hull area.
zh: Solidity是轮廓区域与其凸包区域的比率.

source: Sometimes you will need to work separately on B,G,R channels of image.
zh: 有时您需要在B，G，R通道图像上单独工作.

source: Sometimes, some devices may have limitation such that it can produce only limited number of colors.
zh: 有时，某些设备可能具有限制，使得它只能产生有限数量的颜色。

source: Sometimes, you will have to play with certain region of images.
zh: 有时，您将不得不图像某一个区域。

source: Splitting and Merging Image Channels
zh: 拆分和合并图像通道

source: Splitting and Merging images
zh: 拆分和合并图像

source: Static Public Member Functions inherited from cv::Algorithm
zh: 静态公共成员函数，继承自 cv::Algorithm

source: Stores algorithm parameters in a file storage.
zh: 存储算法参数到文件.

source: Suppose you want to set all the red pixels to zero, you do not need to split the channels first.
zh: 假设您要将所有红色像素设置为零，则无需先拆分通道.

source: Sure coins are colored with different values.
zh: 确定的硬币用不同的值着色.

source: Take it.
zh: 带上它.

source: That is our marker.
zh: 那是我们的标记.

source: That is specified by this contour approximation method.
zh: 这由该轮廓近似方法指定.

source: That said, Python can be easily extended with C/C++, which allows us to write computationally intensive code in C/C++ and create Python wrappers that can be used as Python modules.
zh: 也就是说，Python可以使用C / C ++轻松扩展，这允许我们用C / C ++编写计算密集型代码，并创建可用作Python模块的Python包装器。

source: That would work if objects were not touching each other.
zh: 如果物体没有相互接触，这将起作用.

source: The CRF if of great importance in some computer vision algorithms, including HDR algorithms.
zh: CRF在一些计算机视觉算法中非常重要，包括HDR算法.

source: The Hough Transform is a popular technique to detect any shape, if you can represent that shape in a mathematical form.
zh: 如果您能够以数学形式表示形状，则霍夫变换是一种用于检测任何形状的流行技术

source: The MIL algorithm trains a classifier in an online manner to separate the object from the background...
zh: MIL算法以在线方式训练分类器以将对象与背景分离...

source: The above code can be modified for Gaussian blurring:
zh: 可以修改上述代码以用于高斯模糊:

source: The above method is normally used for selecting a region of an array, say the first 5 rows and last 3 columns.
zh: 上述方法通常用于选择数组的区域，比如前5行和后3列。

source: The algorithm returns the labels that yield the best compactness.
zh: 该算法返回产生最佳紧凑性的标签。

source: The boundary region will be marked with -1.
zh: 边界区域将标记为-1.

source: The bounding box that represent the new target location, if true was returned, not modified otherwise
zh: 建立一个新边界框，如果包含目标则返回，否则继续建立

source: The camera response function (CRF) gives us the connection between the scene radiance to the measured intensity values.
zh: 相机响应功能（CRF）为我们提供了场景辐射与测量强度值之间的连接.

source: The camera response function is represented by a 256-length vector for each color channel.
zh: 相机响应函数由每个颜色通道的256长度矢量表示.

source: The contours are a useful tool for shape analysis and object detection and recognition.
zh: 轮廓是形状分析和物体检测和识别的有用工具.

source: The current frame
zh: 当前帧

source: The dark blue region shows unknown region.
zh: 深蓝色区域显示未知区域.

source: The direction of the vector from this corner point to centroid gives the orientation.
zh: 从该角点到质心的矢量方向给出了方向。

source: The documentation for this class was generated from the following file:
zh: 这个类的文档是从下面的文件生成的:

source: The first method is Debevec and the second one is Robertson.
zh: 第一种方法是Debevec，第二种方法是Robertson.

source: The first stage is simply loading all images into a list.
zh: 第一阶段只是将所有图像加载到列表中。

source: The initial bounding box
zh: 初始化边界框

source: The initial frame
zh: 初始化帧

source: The paper says ORB is much faster than SURF and SIFT and ORB descriptor works better than SURF.
zh: 该论文称ORB比SURF快得多，SIFT和ORB描述符比SURF更好。

source: The regions we know for sure (whether foreground or background) are labelled with any positive integers, but different integers, and the area we don't know for sure are just left as zero.
zh: 我们确定的区域（无论是前景还是背景）都标有任何正整数，但不同的整数，我们不确定的区域只剩下零.

source: The remaining regions are those which we don't have any idea, whether it is coins or background.
zh: 剩下的区域是我们不知道的区域，无论是硬币还是背景.

source: The result is called rBRIEF.
zh: 这个结果被称为 rBRIEF.

source: The scoring function in Harris Corner Detector was given by:
zh: Harris Corner Detector的评分函数由:

source: The shape of an image is accessed by img.shape.
zh: img.shape可以访问图像的形状

source: The value should be given as next argument.
zh: 该值应作为下一个参数给出.

source: Then I made data of np.float32 type.
zh: 然后我转换数据类型为np.float32 type.

source: Then apply watershed algorithm.
zh: 然后应用分水岭算法.

source: Then function takes first strongest corner, throws away all the nearby corners in the range of minimum distance and returns N strongest corners.
zh: 然后函数获取第一个最强的角落，抛弃最小距离范围内的所有角落并返回N个最强的角落.

source: Then it sorts the remaining corners based on quality in the descending order.
zh: 然后它根据质量按降序对剩余的角进行排序.

source: Then marker image will be modified.
zh: 然后将修改标记图像.

source: Then our marker will be updated with the labels we gave, and the boundaries of objects will have a value of -1.
zh: 然后我们的标记将使用我们给出的标签进行更新，对象的边界将具有-1的值.

source: Then pass this as the mask.
zh: 接着传递这个作为掩码mask.

source: Then the barriers you created gives you the segmentation result.
zh: 然后，您创建的障碍为您提供分割结果。

source: Then we can use cv.perspectiveTransform() to find the object.
zh: 接着我们用 cv.perspectiveTransform() 去发现目标.

source: Then we draw it.
zh: 然后我们画它。

source: Then we provide the minimum euclidean distance between corners detected.
zh: 然后我们提供检测到的角之间的最小欧氏距离.

source: Then you specify number of corners you want to find.
zh: 然后指定要查找的角点数.

source: Then you specify the quality level, which is a value between 0-1, which denotes the minimum quality of corner below which everyone is rejected.
zh: 然后指定质量等级，该等级是0-1之间的值，表示每个人被拒绝的角落的最低质量.

source: Theory
zh: 理论

source: There are 3 features, say, R,G,B.
zh: 有3个功能，比如R，G，B。

source: There are different ways to obtain HDR images, but the most common one is to use photographs of the scene taken with different exposure values.
zh: 获得HDR图像的方法有很多种，但最常见的方法是使用不同曝光值拍摄的场景照片。

source: There are still some features left in matlab regionprops doc.
zh: matlab regionprops doc中还有一些功能.

source: There are two ways for this,
zh: 有两个方法,

source: There is a difference between OpenCV addition and Numpy addition.
zh: 这是OpenCV 加法和Numpy加法之间的差异。

source: There is nothing new to be explained here.
zh: 这里没有什么新的东西需要解释。

source: These areas are normally around the boundaries of coins where foreground and background meet (Or even two different coins meet).
zh: 这些区域通常围绕前景和背景相遇的硬币边界（甚至两个不同的硬币相遇）.

source: They are `( type, max_iter, epsilon )`:
zh: 他们是 `( 类型，最大迭代， epsilon )`:

source: They are passed to find the perpective transformation.
zh: 传递它们以找到透视变换。
